04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/sloshingCylinder/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        all;

    solidBodyMotionFunction
    {
        type            multiMotion;

        oscillation
        {
            type        oscillatingLinearMotion;

            amplitude   (0.1 0 0);
            omega       18.8945578;
        }

        rotation
        {
            type        rotatingMotion;

            origin      (0 0.02 0);
            axis        (0 0 1);
            omega       180 [rpm];
        }
    }
}


// ************************************************************************* //
